In [2]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index_s = ['a', 'b', 'c', 'd', 'e']
ser = pd.Series([1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [30]:
# ser[0], ser['a']
ser.iloc[0],ser.loc['a']

(np.int64(1), np.int64(1))

In [10]:
dic = {'a':1, 'b':2,'c':3}
pd.Series(dic)

a    1
b    2
c    3
dtype: int64

In [15]:
ser2 = pd.Series([10, "apple"])
ser2

0       10
1    apple
dtype: object

In [ ]:
population = pd.Series([9776, 2729, 1566, 3158],
                       index=['서울', '부산', '인천', '대구'])
population[['서울', '부산']] #0,1 팬시인덱싱

서울    9776
부산    2729
dtype: int64

In [24]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [32]:
scientists = pd.DataFrame({
                         "Name": ["Rosaline Franklin", "William Gosset"],
                         "Occupation": ["Chemist", "Statistician"],
                         "Born": ["1920-07-25", "1876-06-13"],
                         "Died": ["1958-04-16", "1937-10-16"],
                         "Age": [37, 61],
                         })

scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [39]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [51]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: Rosaline, dtype: object

In [47]:
scientists.index = ['Rosaline', "William"]

In [52]:
scientists.loc['Rosaline']['Name']

'Rosaline Franklin'

In [55]:
data = [[1,2,3],[4,5,6],[7,8,9]]
dt = pd.DataFrame(data)
dt.iloc[0][1]

np.int64(2)

In [58]:
dt = pd.DataFrame(data, columns=['A','B','C'])
dt.iloc[1]['C']

np.int64(6)

In [59]:
sci1 = pd.DataFrame({
                    "Name": ["Rosaline Franklin", "William Gosset"],
                    "Occupation": ["Chemist", "Statistician"],
                    "Born": ["1920-07-25", "1876-06-13"],
                    "Died": ["1958-04-16", "1937-10-16"],
                    "Age": [37, 61],
                    })

In [60]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [64]:
sci1.loc[0, 'Occupation']

'Chemist'

In [65]:
sci1.to_csv('./data/scientist_1.csv')

In [66]:
sci1.to_csv('./data/scientist_2.csv', index=False)

In [67]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [68]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [70]:
# pickle : 파이썬의 객체형을 저장
sci1.to_pickle('./data/scientist.pickle')

In [71]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

# 데이터 미리보기
1. info()
2. head()/tail()

In [73]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [76]:
df1.head(3)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [77]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [79]:
df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [87]:
df1.loc[:,'Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [89]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [95]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [96]:
df.columns

Index(['이름', '나이', '점수'], dtype='object')

In [97]:
df.dtypes

이름    object
나이     int64
점수     int64
dtype: object

In [98]:
df.columns = ['name', 'age', 'score']
df

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [91]:
df.head(3)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [92]:
df.tail(3)

    이름  나이  점수
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [94]:
df.loc[:,'점수'].describe()

count     7.000000
mean     86.000000
std       7.958224
min      73.000000
25%      81.500000
50%      88.000000
75%      91.500000
max      95.000000
Name: 점수, dtype: float64

In [100]:
#data/gapminder.tsv 를 읽어 데이터 프레임 만들기
df3 = pd.read_csv('./data/gapminder.tsv', sep='\t')

In [ ]:
#미리보기
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [102]:
df3.head(3)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

In [103]:
df3.tail(3)

       country continent  year  lifeExp       pop   gdpPercap
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [104]:
#country 열 추출하기
df3.loc[:,'country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [112]:
#'country', 'continent', 'year' 열 추출하기
df3.loc[:,['country', 'continent', 'year']]

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

In [110]:
#[0], [99] , [-1] 행을 각각 추출하기
df3.iloc[[0,99,-1]]

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
99     Bangladesh      Asia  1967   43.453  62821884  721.186086
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298